### AI/ML Session 1 - 26th August 2024 (further practice notebook)
### By - Heta Rahul Patel

---

## Pandas Comprehensive Function Examples

### This notebook contains examples of:

- Data Loading: Reading from CSV and creating DataFrames.
- Data Selection: Using .iloc[], .loc[], and selecting columns.
- Data Cleaning: Handling missing data, replacing values, and dropping columns.
- Data Modification: Adding columns, renaming, and deleting columns.
- Grouping and Aggregation: Using .groupby() and .agg().
- Merging and Joining: Combining DataFrames.
- Sorting: Sorting data by column or index.
- Filtering: Filtering rows based on conditions.
- Statistics: Summary statistics and value counts.
- Pivot Tables: Creating pivot tables for grouped data.
- Reshaping: Melting and pivoting data.
- Handling Duplicates: Removing duplicates from a DataFrame.
- Exporting Data: Exporting DataFrames to CSV.

---

In [1]:
#import
import pandas as pd
import numpy as np

In [2]:
# 1. Data Loading
# Read a CSV file
# df = pd.read_csv('your_file.csv')

In [3]:
# Creating DataFrames directly (example)
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]}
df = pd.DataFrame(data)

print("DataFrame:\n", df)

DataFrame:
       Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

In [4]:
# 2. Data Selection
# Select a single column
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [5]:
# Select multiple columns
print(df[['Name', 'Salary']])

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3    David   80000

In [6]:
# Select rows by index location (using iloc)
print("\nSelect first two rows (iloc):\n", df.iloc[:2])

Select first two rows (iloc):
     Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000

In [7]:
# Select rows by index label (using loc)
print("\nSelect rows where Age > 30 (loc):\n", df.loc[df['Age'] > 30])

Select rows where Age > 30 (loc):
       Name  Age  Salary
2  Charlie   35   70000
3    David   40   80000

In [8]:
# 3. Data Cleaning
# Handling missing data
df_with_nan = df.copy()
df_with_nan.loc[1, 'Salary'] = np.nan
print("\nDataFrame with NaN:\n", df_with_nan)

DataFrame with NaN:
       Name  Age   Salary
0    Alice   25  50000.0
1      Bob   30      NaN
2  Charlie   35  70000.0
3    David   40  80000.0

In [9]:
# Drop rows with missing values
print("\nDrop rows with NaN:\n", df_with_nan.dropna())

Drop rows with NaN:
       Name  Age   Salary
0    Alice   25  50000.0
2  Charlie   35  70000.0
3    David   40  80000.0

In [10]:
# Fill missing values
print("\nFill NaN with mean salary:\n", df_with_nan.fillna(df_with_nan['Salary'].mean()))

Fill NaN with mean salary:
       Name  Age        Salary
0    Alice   25  50000.000000
1      Bob   30  66666.666667
2  Charlie   35  70000.000000
3    David   40  80000.000000

In [11]:
# Replace specific values
print("\nReplace 'Alice' with 'Alicia':\n", df.replace({'Alice': 'Alicia'}))

Replace 'Alice' with 'Alicia':
       Name  Age  Salary
0   Alicia   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

In [12]:
# 4. Data Modification
# Adding new columns
df['Bonus'] = df['Salary'] * 0.1
print("\nDataFrame with Bonus column:\n", df)

DataFrame with Bonus column:
       Name  Age  Salary   Bonus
0    Alice   25   50000  5000.0
1      Bob   30   60000  6000.0
2  Charlie   35   70000  7000.0
3    David   40   80000  8000.0

In [13]:
# Dropping columns
df_dropped = df.drop(columns=['Bonus'])
print("\nDataFrame after dropping 'Bonus' column:\n", df_dropped)

DataFrame after dropping 'Bonus' column:
       Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

In [14]:
# Renaming columns
df_renamed = df.rename(columns={'Name': 'Employee', 'Salary': 'Annual Salary'})
print("\nDataFrame with renamed columns:\n", df_renamed)

DataFrame with renamed columns:
   Employee  Age  Annual Salary   Bonus
0    Alice   25          50000  5000.0
1      Bob   30          60000  6000.0
2  Charlie   35          70000  7000.0
3    David   40          80000  8000.0

In [15]:
# 5. Grouping and Aggregation
# Group by 'Age' and calculate mean salary
grouped = df.groupby('Age').agg({'Salary': 'mean'})
print("\nGrouped by Age with mean Salary:\n", grouped)

Grouped by Age with mean Salary:
       Salary
Age
25   50000.0
30   60000.0
35   70000.0
40   80000.0

In [16]:
# Apply multiple aggregate functions
agg_multi = df.groupby('Age').agg({'Salary': ['mean', 'sum', 'max']})
print("\nGrouped by Age with multiple aggregations:\n", agg_multi)

Grouped by Age with multiple aggregations:
       Salary
        mean    sum    max
Age
25   50000.0  50000  50000
30   60000.0  60000  60000
35   70000.0  70000  70000
40   80000.0  80000  80000

In [17]:
# 6. Merging and Joining DataFrames
# Creating another DataFrame for merge example
data2 = {'Employee': ['Alice', 'Bob', 'Eve', 'Frank'],
         'Department': ['HR', 'IT', 'Marketing', 'Sales']}
df2 = pd.DataFrame(data2)
print(df2)

  Employee Department
0    Alice         HR
1      Bob         IT
2      Eve  Marketing
3    Frank      Sales

In [18]:
# Merge the two DataFrames on 'Employee'
merged_df = pd.merge(df, df2, left_on='Name', right_on='Employee', how='left')
print("\nMerged DataFrame (left join on 'Employee'):\n", merged_df)

Merged DataFrame (left join on 'Employee'):
       Name  Age  Salary   Bonus Employee Department
0    Alice   25   50000  5000.0    Alice         HR
1      Bob   30   60000  6000.0      Bob         IT
2  Charlie   35   70000  7000.0      NaN        NaN
3    David   40   80000  8000.0      NaN        NaN

In [19]:
# 7. Sorting
# Sorting by column values
sorted_df = df.sort_values(by='Salary', ascending=False)
print("\nDataFrame sorted by 'Salary' (descending):\n", sorted_df)

DataFrame sorted by 'Salary' (descending):
       Name  Age  Salary   Bonus
3    David   40   80000  8000.0
2  Charlie   35   70000  7000.0
1      Bob   30   60000  6000.0
0    Alice   25   50000  5000.0

In [20]:
# Sorting by index
sorted_index_df = df.sort_index(ascending=False)
print("\nDataFrame sorted by index (descending):\n", sorted_index_df)

DataFrame sorted by index (descending):
       Name  Age  Salary   Bonus
3    David   40   80000  8000.0
2  Charlie   35   70000  7000.0
1      Bob   30   60000  6000.0
0    Alice   25   50000  5000.0

In [21]:
# 8. Filtering
# Filter rows where Salary > 60000
filtered_df = df[df['Salary'] > 60000]
print("\nFilter rows where Salary > 60000:\n", filtered_df)

Filter rows where Salary > 60000:
       Name  Age  Salary   Bonus
2  Charlie   35   70000  7000.0
3    David   40   80000  8000.0

In [22]:
# 9. Statistics
# Summary statistics for numerical columns
print("\nSummary statistics:\n", df.describe())

Summary statistics:
              Age        Salary        Bonus
count   4.000000      4.000000     4.000000
mean   32.500000  65000.000000  6500.000000
std     6.454972  12909.944487  1290.994449
min    25.000000  50000.000000  5000.000000
25%    28.750000  57500.000000  5750.000000
50%    32.500000  65000.000000  6500.000000
75%    36.250000  72500.000000  7250.000000
max    40.000000  80000.000000  8000.000000

In [23]:
# Value counts for a specific column
print("\nValue counts for 'Age' column:\n", df['Age'].value_counts())

Value counts for 'Age' column:
 Age
25    1
30    1
35    1
40    1
Name: count, dtype: int64

In [24]:
# 10. Pivot Tables
# Create a pivot table
pivot = df.pivot_table(values='Salary', index='Age', columns='Name', aggfunc='mean')
print("\nPivot Table:\n", pivot)

Pivot Table:
 Name    Alice      Bob  Charlie    David
Age
25    50000.0      NaN      NaN      NaN
30        NaN  60000.0      NaN      NaN
35        NaN      NaN  70000.0      NaN
40        NaN      NaN      NaN  80000.0

In [25]:
# 11. Reshaping
# Melting a DataFrame (long format)
melted_df = pd.melt(df, id_vars=['Name'], value_vars=['Age', 'Salary'])
print("\nMelted DataFrame:\n", melted_df)

Melted DataFrame:
       Name variable  value
0    Alice      Age     25
1      Bob      Age     30
2  Charlie      Age     35
3    David      Age     40
4    Alice   Salary  50000
5      Bob   Salary  60000
6  Charlie   Salary  70000
7    David   Salary  80000

In [26]:
# Pivot back to wide format
pivoted_df = melted_df.pivot(index='Name', columns='variable', values='value')
print("\nPivoted DataFrame:\n", pivoted_df)

Pivoted DataFrame:
 variable  Age  Salary
Name
Alice      25   50000
Bob        30   60000
Charlie    35   70000
David      40   80000

In [27]:
# 12. Handling Duplicates
# Adding duplicate data for demonstration
df_dup = pd.concat([df, df.loc[[0, 2]]])
print("\nDataFrame with duplicate rows:\n", df_dup)

DataFrame with duplicate rows:
       Name  Age  Salary   Bonus
0    Alice   25   50000  5000.0
1      Bob   30   60000  6000.0
2  Charlie   35   70000  7000.0
3    David   40   80000  8000.0
0    Alice   25   50000  5000.0
2  Charlie   35   70000  7000.0

In [28]:
# Dropping duplicate rows
df_no_dup = df_dup.drop_duplicates()
print("\nDataFrame with duplicates removed:\n", df_no_dup)

DataFrame with duplicates removed:
       Name  Age  Salary   Bonus
0    Alice   25   50000  5000.0
1      Bob   30   60000  6000.0
2  Charlie   35   70000  7000.0
3    David   40   80000  8000.0

In [30]:
# 13. Exporting Data
# Export DataFrame to CSV
# df.to_csv('exported_file.csv', index=False)

print("\nDataFrame can be exported to CSV with `df.to_csv('exported_file.csv')`")

DataFrame can be exported to CSV with `df.to_csv('exported_file.csv')`

In [29]:
## end of notebook ##